test/vcr_cassettes/reservations_training_with_expired_coupon_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4242424242424242&card[exp_month]=4&card[exp_year]=2019&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_testfaketestfaketestfake
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-29-generic (buildd@lcy01-amd64-024) (gcc version 5.4.0 20160609
        (Ubuntu 5.4.0-6ubuntu1~16.04.10)) #31~16.04.1-Ubuntu SMP Wed Jul 18 08:54:04
        UTC 2018","hostname":"Sleede-SylvainPC"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 24 Jul 2018 12:33:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_QXRQUHInmNlZmv
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1CrPhp2sOmf47Nz97FwR0N0Q",
          "object": "token",
          "card": {
            "id": "card_1CrPhp2sOmf47Nz9kdpFLmfl",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 4,
            "exp_year": 2019,
            "fingerprint": "o52jybR7bnmNn6AT",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "90.112.128.65",
          "created": 1532435613,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Tue, 24 Jul 2018 12:33:33 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/invoiceitems?customer=cus_8Di1wjdVktv5kt&limit=100
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_testfaketestfaketestfake
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-29-generic (buildd@lcy01-amd64-024) (gcc version 5.4.0 20160609
        (Ubuntu 5.4.0-6ubuntu1~16.04.10)) #31~16.04.1-Ubuntu SMP Wed Jul 18 08:54:04
        UTC 2018","hostname":"Sleede-SylvainPC"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 24 Jul 2018 12:33:34 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '14389'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_LVVZrf5H4q95se
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "data": [
            {
              "id": "ii_1CrPhR2sOmf47Nz9GjDTPM59",
              "object": "invoiceitem",
              "amount": -675,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1532435589,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_1CrPhU2sOmf47Nz9LcjmZ0k4",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1532435589,
                "end": 1532435589
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -675
            },
            {
              "id": "ii_1CrPhQ2sOmf47Nz9Kgf1w9jh",
              "object": "invoiceitem",
              "amount": 1500,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1532435588,
              "description": "FORM1+ imprimante 3D July 24, 2018 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1CrPhU2sOmf47Nz9LcjmZ0k4",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1532435588,
                "end": 1532435588
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 1500
            },
            {
              "id": "ii_1CrPgp2sOmf47Nz9KqyvABF7",
              "object": "invoiceitem",
              "amount": 3200,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1532435551,
              "description": "FORM1+ imprimante 3D July 24, 2018 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1CrPgu2sOmf47Nz9SQCXCWyv",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1532435551,
                "end": 1532435551
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 3200
            },
            {
              "id": "ii_1BYyTt2sOmf47Nz9h7btfoKd",
              "object": "invoiceitem",
              "amount": 3200,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1513264721,
              "description": "FORM1+ imprimante 3D December 10, 2017 13:00 - 02:00 PM",
              "discountable": true,
              "invoice": "in_1BYyTz2sOmf47Nz9jyWUyIeG",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1513264721,
                "end": 1513264721
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 3200
            },
            {
              "id": "ii_1BYyTK2sOmf47Nz93VzSjIeZ",
              "object": "invoiceitem",
              "amount": -675,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1513264686,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_1BYyTO2sOmf47Nz952qqhaQ0",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1513264686,
                "end": 1513264686
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -675
            },
            {
              "id": "ii_1BYyTJ2sOmf47Nz9zcESvCJe",
              "object": "invoiceitem",
              "amount": 1500,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1513264685,
              "description": "FORM1+ imprimante 3D December 10, 2017 13:00 - 02:00 PM",
              "discountable": true,
              "invoice": "in_1BYyTO2sOmf47Nz952qqhaQ0",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1513264685,
                "end": 1513264685
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 1500
            },
            {
              "id": "ii_1BYySW2sOmf47Nz9UnnvBAh3",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1513264636,
              "description": "Formation Imprimante 3D December 11, 2017 07:00 - 11:00 AM",
              "discountable": true,
              "invoice": "in_1BYySe2sOmf47Nz9l8dNUsHJ",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1513264636,
                "end": 1513264636
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_1B3L0k2sOmf47Nz9y87SMg3r",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724830,
              "description": "Formation Imprimante 3D September 18, 2017 08:00 - 09:00 AM",
              "discountable": true,
              "invoice": "in_1B3L1k2sOmf47Nz9WrVocGx4",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724830,
                "end": 1505724830
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_1B3L0Y2sOmf47Nz9e9W8bl2Z",
              "object": "invoiceitem",
              "amount": 3200,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724818,
              "description": "FORM1+ imprimante 3D September 17, 2017 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1B3L0d2sOmf47Nz9sybqyVQx",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724818,
                "end": 1505724818
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 3200
            },
            {
              "id": "ii_1B3L0J2sOmf47Nz9lKSNNF1U",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724803,
              "description": "Formation Imprimante 3D September 18, 2017 08:00 - 12:00 PM",
              "discountable": true,
              "invoice": "in_1B3L0N2sOmf47Nz9YpYod08J",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724803,
                "end": 1505724803
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_1B3L012sOmf47Nz948JNFRoK",
              "object": "invoiceitem",
              "amount": -675,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724785,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_1B3L052sOmf47Nz9zx9vIGks",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724785,
                "end": 1505724785
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -675
            },
            {
              "id": "ii_1B3L002sOmf47Nz9FjqPZEye",
              "object": "invoiceitem",
              "amount": 1500,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724784,
              "description": "FORM1+ imprimante 3D September 17, 2017 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1B3L052sOmf47Nz9zx9vIGks",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724784,
                "end": 1505724784
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 1500
            },
            {
              "id": "ii_1B3Kuo2sOmf47Nz9egmtGncE",
              "object": "invoiceitem",
              "amount": 3200,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724462,
              "description": "FORM1+ imprimante 3D September 17, 2017 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1B3Kut2sOmf47Nz9ht8mAIGU",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724462,
                "end": 1505724462
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 3200
            },
            {
              "id": "ii_1B3KuK2sOmf47Nz9RqRGmh0l",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724432,
              "description": "Formation Imprimante 3D September 18, 2017 08:00 - 12:00 PM",
              "discountable": true,
              "invoice": "in_1B3KuO2sOmf47Nz9invMhPqV",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724432,
                "end": 1505724432
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_1B3Ku62sOmf47Nz92wSUMzHq",
              "object": "invoiceitem",
              "amount": -675,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724418,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_1B3Ku92sOmf47Nz9MmYnmpwr",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724418,
                "end": 1505724418
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -675
            },
            {
              "id": "ii_1B3Ku52sOmf47Nz9vmqyS5Gy",
              "object": "invoiceitem",
              "amount": 1500,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1505724417,
              "description": "FORM1+ imprimante 3D September 17, 2017 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_1B3Ku92sOmf47Nz9MmYnmpwr",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1505724417,
                "end": 1505724417
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 1500
            },
            {
              "id": "ii_18rRuK2sOmf47Nz9ye4DQ4PM",
              "object": "invoiceitem",
              "amount": -510,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1473338732,
              "description": "coupon XMAS10",
              "discountable": false,
              "invoice": "in_18rRuO2sOmf47Nz9qbfxBA0D",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1473338732,
                "end": 1473338732
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -510
            },
            {
              "id": "ii_18rRuJ2sOmf47Nz9S7f6qfEz",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1473338731,
              "description": "Formation Imprimante 3D September 05, 2016 08:00 - 09:00 AM",
              "discountable": true,
              "invoice": "in_18rRuO2sOmf47Nz9qbfxBA0D",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1473338731,
                "end": 1473338731
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_18rNSp2sOmf47Nz9S0rJVP2a",
              "object": "invoiceitem",
              "amount": -450,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1473321651,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_18rNSq2sOmf47Nz91hxlGSa7",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1473321651,
                "end": 1473321651
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -450
            },
            {
              "id": "ii_18rNSm2sOmf47Nz9R11Svoer",
              "object": "invoiceitem",
              "amount": -225,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1473321648,
              "description": "coupon SUNNYFABLAB",
              "discountable": false,
              "invoice": "in_18rNSq2sOmf47Nz91hxlGSa7",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1473321648,
                "end": 1473321648
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": -225
            },
            {
              "id": "ii_18rNSm2sOmf47Nz9avgL9KyW",
              "object": "invoiceitem",
              "amount": 1500,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1473321648,
              "description": "FORM1+ imprimante 3D September 04, 2016 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_18rNSq2sOmf47Nz91hxlGSa7",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1473321648,
                "end": 1473321648
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 1500
            },
            {
              "id": "ii_17xeeI2sOmf47Nz9qEhwu9J6",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1460041342,
              "description": "Formation Imprimante 3D April 12, 2016 08:00 - 12:00 PM",
              "discountable": true,
              "invoice": "in_17xeeM2sOmf47Nz9kzn0pC8f",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1460041342,
                "end": 1460041342
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            },
            {
              "id": "ii_17xHFG2sOmf47Nz9hhIaJZtF",
              "object": "invoiceitem",
              "amount": 3200,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1459951378,
              "description": "FORM1+ imprimante 3D April 11, 2016 14:00 - 03:00 PM",
              "discountable": true,
              "invoice": "in_17xHFK2sOmf47Nz9jegPFlNt",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1459951378,
                "end": 1459951378
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 3200
            },
            {
              "id": "ii_17xHF82sOmf47Nz9QT6BnkAZ",
              "object": "invoiceitem",
              "amount": 5100,
              "currency": "usd",
              "customer": "cus_8Di1wjdVktv5kt",
              "date": 1459951370,
              "description": "Formation Imprimante 3D April 12, 2016 08:00 - 09:00 AM",
              "discountable": true,
              "invoice": "in_17xHFC2sOmf47Nz9ZZeO0yST",
              "livemode": false,
              "metadata": {},
              "period": {
                "start": 1459951370,
                "end": 1459951370
              },
              "plan": null,
              "proration": false,
              "quantity": 1,
              "subscription": null,
              "unit_amount": 5100
            }
          ],
          "has_more": false,
          "url": "/v1/invoiceitems"
        }
    http_version: 
  recorded_at: Tue, 24 Jul 2018 12:33:34 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/invoiceitems
    body:
      encoding: UTF-8
      string: customer=cus_8Di1wjdVktv5kt&amount=5100&currency=usd&description=Formation+Imprimante+3D+July+25%2C+2018+08%3A00+-+09%3A00+AM
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.30.2
      Authorization:
      - Bearer sk_test_testfaketestfaketestfake
      Content-Type:
      - application/x-www-form-urlencoded
      Stripe-Version:
      - '2015-10-16'
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.30.2","lang":"ruby","lang_version":"2.3.6 p384 (2017-12-14)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.15.0-29-generic (buildd@lcy01-amd64-024) (gcc version 5.4.0 20160609
        (Ubuntu 5.4.0-6ubuntu1~16.04.10)) #31~16.04.1-Ubuntu SMP Wed Jul 18 08:54:04
        UTC 2018","hostname":"Sleede-SylvainPC"}'
      Content-Length:
      - '125'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 24 Jul 2018 12:33:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '491'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_F24qmWZDgelQ3p
      Stripe-Version:
      - '2015-10-16'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ii_1CrPhr2sOmf47Nz90bCUiJHE",
          "object": "invoiceitem",
          "amount": 5100,
          "currency": "usd",
          "customer": "cus_8Di1wjdVktv5kt",
          "date": 1532435615,
          "description": "Formation Imprimante 3D July 25, 2018 08:00 - 09:00 AM",
          "discountable": true,
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "period": {
            "start": 1532435615,
            "end": 1532435615
          },
          "plan": null,
          "proration": false,
          "quantity": 1,
          "subscription": null,
          "unit_amount": 5100
        }
    http_version: 
  recorded_at: Tue, 24 Jul 2018 12:33:35 GMT
recorded_with: VCR 3.0.1
